FOR CREATING DATA SET
1) structure used is dictionary
2)convert this data structure into data frame by :
pd.DataFrame(data)

In [1]:
import pandas as pd
data={
    "name":["ashi","ali","boom","zain","munna"],
    "age":[25,78,60,65,80],
    "salary":[2500,6500,5400,6544,7000],
    "performance_score":[5,7,9,5,8]
}
print(data)

{'name': ['ashi', 'ali', 'boom', 'zain', 'munna'], 'age': [25, 78, 60, 65, 80], 'salary': [2500, 6500, 5400, 6544, 7000], 'performance_score': [5, 7, 9, 5, 8]}

Convert dataset which is built in dictionary data structure into dataframe

In [2]:
df=pd.DataFrame(data)
print(df)

    name  age  salary  performance_score
0   ashi   25    2500                  5
1    ali   78    6500                  7
2   boom   60    5400                  9
3   zain   65    6544                  5
4  munna   80    7000                  8

There are methods  of data frame) to preview the data in data frame:
1)head()...
2)tail...same as above
3)info()
4)describe()

In [6]:
df.head(2)

   name  age  salary  performance_score
0  ashi   25    2500                  5
1   ali   78    6500                  7

In [10]:
df.tail()

    name  age  salary  performance_score
0   ashi   25    2500                  5
1    ali   78    6500                  7
2   boom   60    5400                  9
3   zain   65    6544                  5
4  munna   80    7000                  8

there are methods to look into the data and take the information of data
1)info,,,,,,,,it tells what type of data in it, number of rows and columns, column names,non null values and the memory usage
2)describe.......it tells the statistical summary of numerical data in  data frame
it tells the count of all the numerical values,mean.std,25%,50%,75% and max number
std tells us the consistency of data by calculating the distance/difference of initial inputs to the respective mean

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               5 non-null      object
 1   age                5 non-null      int64
 2   salary             5 non-null      int64
 3   performance_score  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [14]:
df.describe()

             age     salary  performance_score
count   5.000000     5.0000           5.000000
mean   61.600000  5588.8000           6.800000
std    22.142719  1824.1785           1.788854
min    25.000000  2500.0000           5.000000
25%    60.000000  5400.0000           5.000000
50%    65.000000  6500.0000           7.000000
75%    78.000000  6544.0000           8.000000
max    80.000000  7000.0000           9.000000

there are another attribites which gives us the information about our dataset
1)shape.....it tells the no.of rows and column....it returns value in tuple
2)columns...it gives the columns list in a dataframe
you dont need prenthesis with it
3)df.index	Returns the row index
df.dtypes	Returns data types of each column
df.values	Returns the underlying NumPy array

In [4]:
import pandas as pd
data={
    "name":["ashi","ali","boom","zain","munna"],
    "age":[25,78,60,65,80],
    "salary":[2500,6500,5400,6544,7000],
    "performance_score":[5,7,9,5,8]
}
#print(data)
df=pd.DataFrame(data)
print(df.index)
print(df.shape)
print(df.values)

RangeIndex(start=0, stop=5, step=1)
(5, 4)
[['ashi' 25 2500 5]
 ['ali' 78 6500 7]
 ['boom' 60 5400 9]
 ['zain' 65 6544 5]
 ['munna' 80 7000 8]]

In [3]:
import pandas as pd
data={
    "name":["ashi","ali","boom","zain","munna"],
    "age":[25,78,60,65,80],
    "salary":[2500,6500,5400,6544,7000],
    "performance_score":[5,7,9,5,8]
}
#print(data)
df=pd.DataFrame(data)
print(df.index)

RangeIndex(start=0, stop=5, step=1)

In [19]:
df.columns

Index(['name', 'age', 'salary', 'performance_score'], dtype='object')

selection of columns:filtering data from particular column
1)single selection...df["age]....it returns series and in boolean type
by giving double brackets  [[ ]] it returns data frame and the exact data from the particualr column

In [23]:
print(df["age"])

0    25
1    78
2    60
3    65
4    80
Name: age, dtype: int64

In [ ]:
#single [] indicates and returns column in series
print(type(df["age"]))

<class 'pandas.core.series.Series'>

In [4]:
#[[]] indicates and returns column in a data frame even though you select a single column
print(type(df[["age"]]))
print((df[["age"]]))

<class 'pandas.core.frame.DataFrame'>
   age
0   25
1   78
2   60
3   65
4   80

selecting more than one column we can do via passing a list: df[["name,"age]]

In [29]:
df[["age","name"]]

   age   name
0   25   ashi
1   78    ali
2   60   boom
3   65   zain
4   80  munna

In [30]:
df[["name","age","salary"]]

    name  age  salary
0   ashi   25    2500
1    ali   78    6500
2   boom   60    5400
3   zain   65    6544
4  munna   80    7000

In [36]:
df["age"] > 30

0    False
1     True
2     True
3     True
4     True
Name: age, dtype: bool

In [39]:
df[df["age"]>30]

    name  age  salary  performance_score
1    ali   78    6500                  7
2   boom   60    5400                  9
3   zain   65    6544                  5
4  munna   80    7000                  8

In [45]:
df[(df["age"]>30) & (df["salary"]>6000)]

    name  age  salary  performance_score
1    ali   78    6500                  7
3   zain   65    6544                  5
4  munna   80    7000                  8

In [46]:
df[(df["name"] =="munna") & (df["performance_score"]==8)]

    name  age  salary  performance_score
4  munna   80    7000                  8

NOW APPLY MODIFICATION ON DATA SET BY USING DIFFERENT METHODS

In [ ]:
#TO ADD NEW COLUMN WHEN KEEPING IT TO PROPER INDEX IS NOT AN ISSUE,simple assignment operator works for it
df["Gender"]=["female","male","male","male","male"]
print(df)

    name  age  salary  performance_score  Gender
0   ashi   25    2500                  5  female
1    ali   78    6500                  7    male
2   boom   60    5400                  9    male
3   zain   65    6544                  5    male
4  munna   80    7000                  8    male

In [48]:
#adding new column with bonus in existing salary
df["bonus"]=df["salary"]*0.1
print(df)

    name  age  salary  performance_score  Gender  bonus
0   ashi   25    2500                  5  female  250.0
1    ali   78    6500                  7    male  650.0
2   boom   60    5400                  9    male  540.0
3   zain   65    6544                  5    male  654.4
4  munna   80    7000                  8    male  700.0

In [50]:
df.insert(3,"extra_money",df["salary"]*0.2)
print(df)

    name  age  salary  extra_money  performance_score  Gender  bonus
0   ashi   25    2500        500.0                  5  female  250.0
1    ali   78    6500       1300.0                  7    male  650.0
2   boom   60    5400       1080.0                  9    male  540.0
3   zain   65    6544       1308.8                  5    male  654.4
4  munna   80    7000       1400.0                  8    male  700.0

In [51]:
#modifying existing column data
df["bonus"]=df["salary"]*0.3
print(df)

    name  age  salary  extra_money  performance_score  Gender   bonus
0   ashi   25    2500        500.0                  5  female   750.0
1    ali   78    6500       1300.0                  7    male  1950.0
2   boom   60    5400       1080.0                  9    male  1620.0
3   zain   65    6544       1308.8                  5    male  1963.2
4  munna   80    7000       1400.0                  8    male  2100.0

In [ ]:
#NOW TO REMOVE COLUMN FROM DATA FRAME;DROP METHOD IS BEING USED,INPLACE IS USED TO PERFORME MODIFICATION IN 
# EXISTING DATAFRAME OTHERWISE IT GIVES YOU ANOTHER COPY
df.drop(columns=["extra_money"],inplace=True)
print(df)

    name  age  salary  performance_score  Gender   bonus
0   ashi   25    2500                  5  female   750.0
1    ali   78    6500                  7    male  1950.0
2   boom   60    5400                  9    male  1620.0
3   zain   65    6544                  5    male  1963.2
4  munna   80    7000                  8    male  2100.0

In [54]:
df.drop(columns=["bonus"],inplace=True)
print(df)

    name  age  salary  performance_score  Gender
0   ashi   25    2500                  5  female
1    ali   78    6500                  7    male
2   boom   60    5400                  9    male
3   zain   65    6544                  5    male
4  munna   80    7000                  8    male

DROP METHOD IS USED TO SIMPLY DROP THE COLUMN WHICH NO LONGER NEEDED OR WHATSOEVER,
ISNULL()METHOD IS USED TO SEE THE VALUES WITH NULL OR NONE VALUES

In [13]:
import pandas as pd
data={
    "name":["ashi",None,"boom","zain","munna"],
    "age":[25,None,98,65,80],
    "salary":[2500,None,5400,6544,7000],
    "performance_score":[5,None,9,5,8]
}
#print(data)
df=pd.DataFrame(data)
print(df)
df.isnull().sum()
#df.dropna(inplace=True)
#print(df)
df.fillna(0,inplace=True)
print(df)

    name   age  salary  performance_score
0   ashi  25.0  2500.0                5.0
1   None   NaN     NaN                NaN
2   boom  98.0  5400.0                9.0
3   zain  65.0  6544.0                5.0
4  munna  80.0  7000.0                8.0
    name   age  salary  performance_score
0   ashi  25.0  2500.0                5.0
1      0   0.0     0.0                0.0
2   boom  98.0  5400.0                9.0
3   zain  65.0  6544.0                5.0
4  munna  80.0  7000.0                8.0

In [60]:
df=pd.DataFrame(data)
print(df)

    name   age  salary  performance_score
0   ashi  25.0  2500.0                5.0
1   None   NaN     NaN                NaN
2   boom  98.0  5400.0                9.0
3   zain  65.0  6544.0                5.0
4  munna  80.0  7000.0                8.0

In [8]:
df.isnull().sum()

name                 0
age                  0
salary               0
performance_score    0
dtype: int64

In [7]:
df.notnull().sum()

name                 5
age                  5
salary               5
performance_score    5
dtype: int64

In [ ]:
#as dropna method to remove missing values we have fillna to fill those values
#df.fillna(0,inplace=True)
#print(df)

In [71]:
df["age"].fillna(df["age"].mean(),inplace=True)
print(df)

    name   age  salary  performance_score
0   ashi  25.0  2500.0                5.0
1      0   0.0     0.0                0.0
2   boom  98.0  5400.0                9.0
3   zain  65.0  6544.0                5.0
4  munna  80.0  7000.0                8.0

C:\Users\saifia computer\AppData\Local\Temp\ipykernel_17152\196195852.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].fillna(df["age"].mean(),inplace=True)

In [72]:
df["age"].fillna(df["age"].mean(),inplace=True)
print(df)

    name   age  salary  performance_score
0   ashi  25.0  2500.0                5.0
1      0   0.0     0.0                0.0
2   boom  98.0  5400.0                9.0
3   zain  65.0  6544.0                5.0
4  munna  80.0  7000.0                8.0

C:\Users\saifia computer\AppData\Local\Temp\ipykernel_17152\196195852.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].fillna(df["age"].mean(),inplace=True)

In [78]:
import pandas as pd
data={
    "name":["ashi",None,"boom","zain","munna"],
    "age":[25,None,98,65,80],
    "salary":[2500,None,5400,6544,7000],
    "performance_score":[5,None,9,5,8]
}
df=pd.DataFrame(data)
df.fillna({
    "age": df["age"].mean(),
    "salary": df["salary"].mean()
}, inplace=True)
print(df)

    name   age  salary  performance_score
0   ashi  25.0  2500.0                5.0
1   None  67.0  5361.0                NaN
2   boom  98.0  5400.0                9.0
3   zain  65.0  6544.0                5.0
4  munna  80.0  7000.0                8.0

ITS NOT ALWAYS A GOOD PRACTICE TO FILL WITH RANDOM VALUES,PANDAS PROVIDE INTERPOLATION METHOD WHICH IS USED TO FILL THE VALUES
BASED ON ESTIMATION,USUALLY WORKS WITH TIME SERIES DATA:
LINEAR INTERPOLATION,POLYNOMIAL,TIME,QUADRATICAL AND SO ON

PROS:
1)DATA INTREGITY
2)ESTIMATION BASED VALUES INSERTION
3)SMOOTH TRANSITION
AXIS=0 MEAN ROWS.AXIS=1 FOR COLUMNS

cons:
doesnt work with categorical data
not always work well when there is no structured data,predication can go wrong

In [79]:
#FOR INTERPOLATION
data={
    "time":[10,20,None,40,50],
    "Value":[100,200,None,400,500]
}
df=pd.DataFrame(data)
df.interpolate(method="linear",axis=0,inplace=True)
print(df)

   time  Value
0  10.0  100.0
1  20.0  200.0
2  30.0  300.0
3  40.0  400.0
4  50.0  500.0

SORTING OF DATA:

In [81]:
#sorting of data
import pandas as pd
data={
    "name":["ashi","ali","boom","zain","munna"],
    "age":[25,78,60,65,80],
    "salary":[2500,6500,5400,6544,7000],
    "performance_score":[5,7,9,5,8]
}
df=pd.DataFrame(data)
df.sort_values(by="age",ascending=True,inplace=True)
print(df)

    name  age  salary  performance_score
0   ashi   25    2500                  5
2   boom   60    5400                  9
3   zain   65    6544                  5
1    ali   78    6500                  7
4  munna   80    7000                  8

In [82]:
df.sort_values(by="salary",ascending=False,inplace=True)
print(df)

    name  age  salary  performance_score
4  munna   80    7000                  8
3   zain   65    6544                  5
1    ali   78    6500                  7
2   boom   60    5400                  9
0   ashi   25    2500                  5

In [83]:
#NOW MULTIPLE SORTING 
df.sort_values(by=["salary","performance_score"],ascending=[True,True],inplace=True)
print(df)

    name  age  salary  performance_score
0   ashi   25    2500                  5
2   boom   60    5400                  9
1    ali   78    6500                  7
3   zain   65    6544                  5
4  munna   80    7000                  8

In [89]:
#sorting of data
import pandas as pd
data={
    "name":["ashi","ali","boom","zain","munna"],
    "age":[25,78,60,65,80],
    "salary":[2500,6500,5400,6544,7000],
    "performance_score":[5,7,9,5,8]
}
df=pd.DataFrame(data)
#AGGREGATING......SUMMARY OF STASTICAL DATA
finding_avg=df["salary"].mean()
df["age"].max()
finding_min=df["performance_score"].min()
print(finding_avg)
#print(finding_max)
print(finding_min)

5588.8
5

MERGING AND JOINING:
WE NEED TO ADD 2 DATA FRAMES WHICH HAVE COMMON PROPERTIES.,WHICH IS COMMON IN BOTH DATA FRAMES
PD.MERGE(DF1,DF2,ON="COLUMN_NAME",HOW="TYPE OF JOIN")
INNER JOIN.OUTER,CROSS,LEFT,RIGHT)JOINS
INNER JOIN(JOIN ON THE BASES OF COMMON COLUMN)returns only the matching values
OUTER JOIN()IT MERGES AND COMBINES THE WHOLE(ROWS) DATA SET,VALUE WHICH IT CANT FIND PLACE THEM WITH NAN
LEFT JOIN( KEEP THE VALUES OF LEFT )
RIGHT JOIN(KEEP THE VALUE OF RIGHT DATA FRAME)....THE VALUE WHICH IT DOESNT GET ,REPLACE IT WILL NAN 
CROSS JOIN(CARTESIAN PRODUCT)M*N ROWS PRODUCES IN A RESULT.....COMBINE PAIRS OF ROWS IN A DATA SET

In [95]:
#MERGING DATA FRAMES
import pandas as pd
data1={
    "name":["ali","iqra","bisma"],
    "order":[2000,4000,6000]
}
data2={
    "id":[1,2,3],
    "order":[2000,4000,9000]

}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df_merged_inner=pd.merge(df1,df2,on="order",how="inner")
print(df_merged_inner)
df_merged_outer=pd.merge(df1,df2,on="order",how="outer")
print(df_merged_outer)
df_merged_left=pd.merge(df1,df2,on="order",how="left")
print(df_merged_left)
df_merged_right=pd.merge(df1,df2,on="order",how="right")
print(df_merged_right)
df_merged_cross=pd.merge(df1,df2,how="cross")
print(df_merged_cross)

   name  order  id
0   ali   2000   1
1  iqra   4000   2
    name  order   id
0    ali   2000  1.0
1   iqra   4000  2.0
2  bisma   6000  NaN
3    NaN   9000  3.0
    name  order   id
0    ali   2000  1.0
1   iqra   4000  2.0
2  bisma   6000  NaN
   name  order  id
0   ali   2000   1
1  iqra   4000   2
2   NaN   9000   3
    name  order_x  id  order_y
0    ali     2000   1     2000
1    ali     2000   2     4000
2    ali     2000   3     9000
3   iqra     4000   1     2000
4   iqra     4000   2     4000
5   iqra     4000   3     9000
6  bisma     6000   1     2000
7  bisma     6000   2     4000
8  bisma     6000   3     9000

CONCATENATION.....COMBINE DATAFRAMES EITHER IN VERTICALLY OR HORIZONTALLY
ADDING DATA FRAMES.....VERTICALLY....AXIS 0...ROW WISE
HORIZONTALLY....COLUMN WISE....AXIS=1..........COLUMN WISE
PD.CONCAT([DF1,DF2],AXIS-0,IGNORE_AXIS-TRUE).........PASS THE LIST OF 2 DATA FRAMES

In [ ]:
#concatination
import pandas as pd
data1={
    "name":["ali","iqra","bisma"],
    "order":[2000,4000,6000]
}
data2={
    "id":[1,2,3],
    "order_num":[10,20,30]

}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df_concat=pd.concat([df1,df2],axis=0,ignore_index=True)
print(df_concat)

    name   order   id  order_num
0    ali  2000.0  NaN        NaN
1   iqra  4000.0  NaN        NaN
2  bisma  6000.0  NaN        NaN
3    NaN     NaN  1.0       10.0
4    NaN     NaN  2.0       20.0
5    NaN     NaN  3.0       30.0

In [99]:
#concatination
import pandas as pd
data1={
    "name":["ali","iqra","bisma"],
    "order":[2000,4000,6000]
}
data2={
    "name":["aliyana","iqrar","bisma khan"],
    "order":[6000,10000,50000]
}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df_concat_vertically=pd.concat([df1,df2],axis=0,ignore_index=True)
print(df_concat)
df_concat_horizontally=pd.concat([df1,df2],axis=1,ignore_index=True)
print(df_concat_horizontally)

         name  order
0         ali   2000
1        iqra   4000
2       bisma   6000
3     aliyana   6000
4       iqrar  10000
5  bisma khan  50000
       0     1           2      3
0    ali  2000     aliyana   6000
1   iqra  4000       iqrar  10000
2  bisma  6000  bisma khan  50000